CUsersHYPERPCDocuments1CDemoConversion1/src/DataProcessors/КопированиеСоставаКонвертаций/КопированиеСоставаКонвертаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КопированиеСоставаКонвертаций</name>
  <attributes>
    <name>КонвертацияИсточник</name>
    <type>
      <types>CatalogRef.Конвертации</types>
    </type>
  </attributes>
  <attributes>
    <name>КонвертацияПолучатель</name>
    <type>
      <types>CatalogRef.Конвертации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбрабатыватьПОД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбрабатыватьПКО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбрабатыватьПКПД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбрабатыватьАлгоритмы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

CUsersHYPERPCDocuments1CDemoConversion1/src/DataProcessors/КопированиеСоставаКонвертаций/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.ОбрабатыватьАлгоритмы = Истина;
	Объект.ОбрабатыватьПКО = Истина;
	Объект.ОбрабатыватьПКПД = Истина;
	Объект.ОбрабатыватьПОД = Истина;
	УстановитьВидимость();
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СоставДанныхПриИзменении(Элемент)
	Если СоставДанных = 0 Тогда
		// Все
		Объект.ОбрабатыватьАлгоритмы = Истина;
		Объект.ОбрабатыватьПКО = Истина;
		Объект.ОбрабатыватьПКПД = Истина;
		Объект.ОбрабатыватьПОД = Истина;
	КонецЕсли;
	УстановитьВидимость();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КопироватьСоставКонвертации(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		КопироватьСоставКонвертацииНаСервере();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура УстановитьВидимость()
	Элементы.ГруппаСоставВыборочно.Видимость = (СоставДанных <> 0);
КонецПроцедуры

&НаСервере
Процедура КопироватьСоставКонвертацииНаСервере()
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.ЗаполнитьСоставКонвертации();
КонецПроцедуры
#КонецОбласти
